onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_ШаблоныСообщений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтандартногоШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкиMAX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоляШаблона</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АлгоритмРасчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_ШаблоныСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Контекст) Экспорт

	Возврат СформироватьЗначениеПоШаблону(Шаблон.ШаблонСообщения, Шаблон, Получатель, Контекст);

КонецФункции

Функция СформироватьКнопкиПоШаблону(Шаблон, Получатель, Контекст) Экспорт

	Если ПустаяСтрока(Шаблон.КнопкиMAX) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	СтрокаJSON = СформироватьЗначениеПоШаблону(Шаблон.КнопкиMAX, Шаблон, Получатель, Контекст);

	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Кнопки = ПрочитатьJSON(ЧтениеJSON);
		Возврат ?(ТипЗнч(Кнопки) = Тип("Массив"), Кнопки, Новый Массив);
	Исключение
		ЗаписьЖурналаРегистрации(
			"ОМНИ.MAX.ШаблонКнопок", УровеньЖурналаРегистрации.Ошибка, , Шаблон.Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Новый Массив;
	КонецПопытки;

КонецФункции

Функция СтандартныйШаблон(Идентификатор) Экспорт

	Возврат НайтиПоРеквизиту("ИдентификаторСтандартногоШаблона", Идентификатор);

КонецФункции

Функция СтандартныеШаблоны() Экспорт

	Шаблоны = Новый Массив;

	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_WELCOME",
		"MAX: приветствие и запрос контакта",
		"Здравствуйте! Чтобы мы могли показать ваши записи и анкеты, отправьте номер телефона, привязанный к вашему аккаунту MAX.",
		"",
		КнопкиВJSON(РядыИзОднойКнопки(КнопкаMAX("request_contact", "Отправить контакт"))),
		Новый Массив);

	Поля = Новый Массив;
	Поля.Добавить(ПолеШаблона("ИмяКлиента", "Результат = ЗначениеПоляКонтекста(Контекст, ""client_name"");"));
	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_AUTH_SUCCESS",
		"MAX: успешная авторизация",
		"Спасибо, <ИмяКлиента>! Авторизация прошла успешно. Теперь вам доступны записи на приём и анкеты клиники.",
		"",
		"",
		Поля);

	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_AUTH_DENIED",
		"MAX: отказ в авторизации",
		"Не удалось подтвердить ваш номер телефона или найти единственную карточку пациента. Пожалуйста, свяжитесь с клиникой.",
		"",
		"",
		Новый Массив);

	Поля = ПоляЗаписи();
	РядыКнопок = Новый Массив;
	ДобавитьРядКнопок(РядыКнопок, КнопкаMAX(
		"open_app", "Подтвердить", "appointment_<ИдентификаторЗаписи>_confirm"));
	ДобавитьРядКнопок(РядыКнопок, КнопкаMAX(
		"open_app", "Перенести", "appointment_<ИдентификаторЗаписи>_reschedule"));
	ДобавитьРядКнопок(РядыКнопок, КнопкаMAX(
		"open_app", "Отменить", "appointment_<ИдентификаторЗаписи>_cancel"));
	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_APPOINTMENT_CREATED",
		"MAX: создана запись",
		"Вы записаны на приём <ДатаЗаписи> в <ВремяЗаписи>."
			+ Символы.ПС + "Врач: <Врач>."
			+ Символы.ПС + "Филиал: <Адрес>.",
		"",
		"",
		Поля);

	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_APPOINTMENT_CONFIRM_REQUEST",
		"MAX: запрос подтверждения записи",
		"Пожалуйста, подтвердите запись на приём <ДатаЗаписи> в <ВремяЗаписи>."
			+ Символы.ПС + "Врач: <Врач>."
			+ Символы.ПС + "Филиал: <Адрес>.",
		"",
		КнопкиВJSON(РядыКнопок),
		Поля);

	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_APPOINTMENT_REMINDER",
		"MAX: напоминание о записи",
		"Напоминаем о записи на приём <ДатаЗаписи> в <ВремяЗаписи>."
			+ Символы.ПС + "Врач: <Врач>."
			+ Символы.ПС + "Адрес: <Адрес>."
			+ Символы.ПС + "Откройте запись и подтвердите выбранное действие в мини-приложении.",
		"",
		КнопкиВJSON(РядыКнопок),
		Поля);

	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_APPOINTMENT_CANCELLED",
		"MAX: запись отменена",
		"Ваша запись на <ДатаЗаписи> в <ВремяЗаписи> отменена.",
		"",
		"",
		Поля);

	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_APPOINTMENT_CONFIRMED",
		"MAX: запись подтверждена",
		"Ваша запись на <ДатаЗаписи> в <ВремяЗаписи> подтверждена. Будем ждать вас!",
		"",
		"",
		Поля);

	Поля = Новый Массив;
	Поля.Добавить(ПолеШаблона(
		"ИдентификаторАнкеты", "Результат = ЗначениеПоляКонтекста(Контекст, ""survey_id"");"));
	Поля.Добавить(ПолеШаблона(
		"НаименованиеАнкеты", "Результат = ЗначениеПоляКонтекста(Контекст, ""survey_title"");"));
	РядыКнопок = Новый Массив;
	ДобавитьРядКнопок(РядыКнопок, КнопкаMAX(
		"open_app", "Пройти анкетирование", "survey_<ИдентификаторАнкеты>"));
	ДобавитьСтандартныйШаблон(
		Шаблоны,
		"MAX_SURVEY_REQUEST",
		"MAX: просьба пройти анкетирование",
		"Пожалуйста, заполните анкету «<НаименованиеАнкеты>» до приёма.",
		"",
		КнопкиВJSON(РядыКнопок),
		Поля);

	УстановитьПризнакЗагрузки(Шаблоны);
	Возврат Шаблоны;

КонецФункции

Функция ЗагрузитьСтандартныеШаблоны(Идентификаторы) Экспорт

	Если ТипЗнч(Идентификаторы) <> Тип("Массив") Или Идентификаторы.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;

	КоличествоЗагруженных = 0;
	Для Каждого ОписаниеШаблона Из СтандартныеШаблоны() Цикл

		Если Идентификаторы.Найти(ОписаниеШаблона.Идентификатор) = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СсылкаШаблона = СтандартныйШаблон(ОписаниеШаблона.Идентификатор);
		Если СсылкаШаблона.Пустая() Тогда
			ОбъектШаблона = СоздатьЭлемент();
		Иначе
			ОбъектШаблона = СсылкаШаблона.ПолучитьОбъект();
		КонецЕсли;

		ЗаполнитьОбъектСтандартногоШаблона(ОбъектШаблона, ОписаниеШаблона);
		ОбъектШаблона.Записать();
		КоличествоЗагруженных = КоличествоЗагруженных + 1;

	КонецЦикла;

	Возврат КоличествоЗагруженных;

КонецФункции

Функция СоздатьСтандартныеШаблоныЕслиОтсутствуют(Идентификаторы) Экспорт

	Если ТипЗнч(Идентификаторы) <> Тип("Массив") Или Идентификаторы.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;

	КоличествоСозданных = 0;
	Для Каждого ОписаниеШаблона Из СтандартныеШаблоны() Цикл
		Если Идентификаторы.Найти(ОписаниеШаблона.Идентификатор) = Неопределено
			Или Не СтандартныйШаблон(ОписаниеШаблона.Идентификатор).Пустая()
		Тогда
			Продолжить;
		КонецЕсли;

		ОбъектШаблона = СоздатьЭлемент();
		ЗаполнитьОбъектСтандартногоШаблона(ОбъектШаблона, ОписаниеШаблона);
		ОбъектШаблона.Записать();
		КоличествоСозданных = КоличествоСозданных + 1;
	КонецЦикла;

	Возврат КоличествоСозданных;

КонецФункции

Функция ЗначениеПоляКонтекста(Контекст, ИмяПоля) Экспорт

	Если Контекст = Неопределено Или Контекст = Null Тогда
		Возврат "";
	КонецЕсли;

	ИменаПолей = Новый Массив;
	ИменаПолей.Добавить(ИмяПоля);
	Для Каждого Псевдоним Из ПсевдонимыПоля(ИмяПоля) Цикл
		ИменаПолей.Добавить(Псевдоним);
	КонецЦикла;

	Для Каждого ИмяПоляКонтекста Из ИменаПолей Цикл
		РезультатПоиска = ЗначениеКонтекстаПоИмени(Контекст, ИмяПоляКонтекста);
		Если РезультатПоиска.Найдено Тогда
			Возврат СтроковоеЗначениеПоляКонтекста(ИмяПоля, РезультатПоиска.Значение);
		КонецЕсли;
	КонецЦикла;

	Если ИмяПоля = "appointment_id" Или ИмяПоля = "survey_id" Тогда
		Попытка
			Возврат Строка(Контекст.УникальныйИдентификатор());
		Исключение
			Возврат "";
		КонецПопытки;
	КонецЕсли;

	Возврат "";

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗначениеПоШаблону(ИсходноеЗначение, Шаблон, Получатель, Контекст)

	РезультирующаяСтрока = ИсходноеЗначение;
	НачалоБлока = ?(НРег(Шаблон.ВариантФормата) = "html", "{{ ", "<");
	КонецБлока = ?(НРег(Шаблон.ВариантФормата) = "html", " }}", ">");

	Для Каждого ПолеШаблона Из Шаблон.ПоляШаблона Цикл
		Поле = НачалоБлока + ПолеШаблона.Поле + КонецБлока;
		Результат = "";
		Выполнить(ПолеШаблона.АлгоритмРасчета);
		РезультирующаяСтрока = СтрЗаменить(РезультирующаяСтрока, Поле, СтроковоеЗначение(Результат));
	КонецЦикла;

	Возврат РезультирующаяСтрока;

КонецФункции

Процедура ДобавитьСтандартныйШаблон(
	Шаблоны, Идентификатор, Наименование, Текст, Формат, Кнопки, Поля)

	Шаблоны.Добавить(Новый Структура(
		"Идентификатор, Наименование, Текст, Формат, Кнопки, Поля, УжеЗагружен",
		Идентификатор, Наименование, Текст, Формат, Кнопки, Поля, Ложь));

КонецПроцедуры

Процедура ЗаполнитьОбъектСтандартногоШаблона(ОбъектШаблона, ОписаниеШаблона)

	ОбъектШаблона.Наименование = ОписаниеШаблона.Наименование;
	ОбъектШаблона.ИдентификаторСтандартногоШаблона = ОписаниеШаблона.Идентификатор;
	ОбъектШаблона.ШаблонСообщения = ОписаниеШаблона.Текст;
	ОбъектШаблона.ВариантФормата = ОписаниеШаблона.Формат;
	ОбъектШаблона.КнопкиMAX = ОписаниеШаблона.Кнопки;
	ОбъектШаблона.ПоляШаблона.Очистить();

	Для Каждого ОписаниеПоля Из ОписаниеШаблона.Поля Цикл
		СтрокаПоля = ОбъектШаблона.ПоляШаблона.Добавить();
		СтрокаПоля.Поле = ОписаниеПоля.Поле;
		СтрокаПоля.АлгоритмРасчета = ОписаниеПоля.АлгоритмРасчета;
	КонецЦикла;

КонецПроцедуры

Функция ПоляЗаписи()

	Поля = Новый Массив;
	Поля.Добавить(ПолеШаблона(
		"ИдентификаторЗаписи", "Результат = ЗначениеПоляКонтекста(Контекст, ""appointment_id"");"));
	Поля.Добавить(ПолеШаблона(
		"ДатаЗаписи", "Результат = ЗначениеПоляКонтекста(Контекст, ""appointment_date"");"));
	Поля.Добавить(ПолеШаблона(
		"ВремяЗаписи", "Результат = ЗначениеПоляКонтекста(Контекст, ""appointment_time"");"));
	Поля.Добавить(ПолеШаблона(
		"Врач", "Результат = ЗначениеПоляКонтекста(Контекст, ""doctor"");"));
	Поля.Добавить(ПолеШаблона(
		"Адрес", "Результат = ЗначениеПоляКонтекста(Контекст, ""address"");"));
	Возврат Поля;

КонецФункции

Функция ПолеШаблона(Поле, АлгоритмРасчета)

	Возврат Новый Структура("Поле, АлгоритмРасчета", Поле, АлгоритмРасчета);

КонецФункции

Функция КнопкаMAX(ТипКнопки, ТекстКнопки, Параметр = "")

	Кнопка = Новый Структура("type, text", ТипКнопки, ТекстКнопки);
	Если ТипКнопки = "open_app" И Не ПустаяСтрока(Параметр) Тогда
		Кнопка.Вставить("payload", Параметр);
	ИначеЕсли ТипКнопки = "link" И Не ПустаяСтрока(Параметр) Тогда
		Кнопка.Вставить("url", Параметр);
	ИначеЕсли ТипКнопки = "callback" И Не ПустаяСтрока(Параметр) Тогда
		Кнопка.Вставить("payload", Параметр);
	КонецЕсли;
	Возврат Кнопка;

КонецФункции

Функция КнопкиВJSON(РядыКнопок)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, РядыКнопок);
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция РядыИзОднойКнопки(Кнопка)

	РядыКнопок = Новый Массив;
	ДобавитьРядКнопок(РядыКнопок, Кнопка);
	Возврат РядыКнопок;

КонецФункции

Процедура ДобавитьРядКнопок(РядыКнопок, Кнопка)

	РядКнопок = Новый Массив;
	РядКнопок.Добавить(Кнопка);
	РядыКнопок.Добавить(РядКнопок);

КонецПроцедуры

Процедура УстановитьПризнакЗагрузки(Шаблоны)

	Идентификаторы = Новый Массив;
	Для Каждого Шаблон Из Шаблоны Цикл
		Идентификаторы.Добавить(Шаблон.Идентификатор);
	КонецЦикла;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Шаблоны.ИдентификаторСтандартногоШаблона КАК Идентификатор
		|ИЗ
		|	Справочник.бит_омни_ШаблоныСообщений КАК Шаблоны
		|ГДЕ
		|	Шаблоны.ИдентификаторСтандартногоШаблона В(&Идентификаторы)
		|	И НЕ Шаблоны.ПометкаУдаления");
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);

	Загруженные = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Загруженные.Вставить(Выборка.Идентификатор, Истина);
	КонецЦикла;

	Для Каждого Шаблон Из Шаблоны Цикл
		Шаблон.УжеЗагружен = Загруженные.Получить(Шаблон.Идентификатор) = Истина;
	КонецЦикла;

КонецПроцедуры

Функция ПсевдонимыПоля(ИмяПоля)

	Псевдонимы = Новый Массив;
	Если ИмяПоля = "appointment_id" Тогда
		Псевдонимы.Добавить("appointmentId");
		Псевдонимы.Добавить("ИдентификаторЗаписи");
		Псевдонимы.Добавить("СсылкаПосле");
	ИначеЕсли ИмяПоля = "survey_id" Тогда
		Псевдонимы.Добавить("surveyId");
		Псевдонимы.Добавить("ИдентификаторАнкеты");
	ИначеЕсли ИмяПоля = "client_name" Тогда
		Псевдонимы.Добавить("НаименованиеКлиента");
		Псевдонимы.Добавить("ИмяКлиента");
	ИначеЕсли ИмяПоля = "appointment_date" Тогда
		Псевдонимы.Добавить("ДатаЗаписи");
		Псевдонимы.Добавить("ДатаНачалаПосле");
	ИначеЕсли ИмяПоля = "appointment_time" Тогда
		Псевдонимы.Добавить("ВремяЗаписи");
		Псевдонимы.Добавить("ДатаНачалаПосле");
	ИначеЕсли ИмяПоля = "doctor" Тогда
		Псевдонимы.Добавить("Врач");
		Псевдонимы.Добавить("СотрудникПосле");
	ИначеЕсли ИмяПоля = "address" Тогда
		Псевдонимы.Добавить("Адрес");
		Псевдонимы.Добавить("ФилиалПосле");
	ИначеЕсли ИмяПоля = "survey_title" Тогда
		Псевдонимы.Добавить("НаименованиеАнкеты");
		Псевдонимы.Добавить("surveyTemplateTitle");
	КонецЕсли;

	Возврат Псевдонимы;

КонецФункции

Функция ЗначениеКонтекстаПоИмени(Контекст, ИмяПоля)

	Значение = Неопределено;
	Если ТипЗнч(Контекст) = Тип("Структура") Тогда
		Возврат Новый Структура("Найдено, Значение", Контекст.Свойство(ИмяПоля, Значение), Значение);
	КонецЕсли;

	Попытка
		Значение = Контекст[ИмяПоля];
		Возврат Новый Структура("Найдено, Значение", Истина, Значение);
	Исключение
		Возврат Новый Структура("Найдено, Значение", Ложь, Неопределено);
	КонецПопытки;

КонецФункции

Функция СтроковоеЗначениеПоляКонтекста(ИмяПоля, Значение)

	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат "";
	КонецЕсли;

	Если ИмяПоля = "appointment_id" Или ИмяПоля = "survey_id" Тогда
		Попытка
			Возврат Строка(Значение.УникальныйИдентификатор());
		Исключение
			Возврат СтроковоеЗначение(Значение);
		КонецПопытки;
	ИначеЕсли ИмяПоля = "appointment_date" И ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=dd.MM.yyyy");
	ИначеЕсли ИмяПоля = "appointment_time" И ТипЗнч(Значение) = Тип("Дата") Тогда
		Возврат Формат(Значение, "ДФ=HH:mm");
	КонецЕсли;

	Возврат СтроковоеЗначение(Значение);

КонецФункции

Функция СтроковоеЗначение(Значение)

	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат "";
	КонецЕсли;
	Возврат Строка(Значение);

КонецФункции

#КонецОбласти
